/*++ 
Copyright (c) 2010 WonderMedia Technologies, Inc.

This program is free software: you can redistribute it and/or modify it under
the terms of the GNU General Public License as published by the Free Software 
Foundation, either version 2 of the License, or (at your option) any later version.

This program is distributed in the hope that it will be useful, but WITHOUT ANY
WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A
PARTICULAR PURPOSE.  See the GNU General Public License for more details. You
should have received a copy of the GNU General Public License along with this
program. If not, see http://www.gnu.org/licenses/>.

WonderMedia Technologies, Inc.
10F, 529, Chung-Cheng Road, Hsin-Tien, Taipei 231, R.O.C.
--*/


#ifndef __MAC_H__
#define __MAC_H__

#if !defined(__TTYPE_H__)
#include "ttype.h"
#endif
#if !defined(__TMACRO_H__)
#include "tmacro.h"
#endif
#if !defined(__UPC_H__)
#include "upc.h"
#endif

#include "adapter.h"



/*---------------------  Export Definitions -------------------------*/
/*
 * Registers in the MAC
 */
#define MAC_REG_PAR         0x00        /* physical address */
#define MAC_REG_RCR         0x06
#define MAC_REG_TCR         0x07
#define MAC_REG_CR0_SET     0x08
#define MAC_REG_CR1_SET     0x09
#define MAC_REG_CR2_SET     0x0A
#define MAC_REG_CR3_SET     0x0B
#define MAC_REG_CR0_CLR     0x0C
#define MAC_REG_CR1_CLR     0x0D
#define MAC_REG_CR2_CLR     0x0E
#define MAC_REG_CR3_CLR     0x0F

#define PWCFG_WOLTYPE           0x20    /* pulse(1) or button (0) */
#define PWCFG_LEGCY_WOL         0x10
#define PWCFG_PMCSR_PME_SR      0x08
#define PWCFG_PMCSR_PME_EN      0x04    /* control by PCISTICK */
#define PWCFG_LEGACY_WOLSR      0x02    /* Legacy WOL_SR shadow */
#define PWCFG_LEGACY_WOLEN      0x01    /* Legacy WOL_EN shadow */

/*
 * Bits in WOLCFG
 */
#define WOLCFG_PMEOVR           0x80    /* for legacy use, force PMEEN always */
#define WOLCFG_SAM              0x20    /* accept multicast case reset, default=0 */
#define WOLCFG_SAB              0x10    /* accept broadcast case reset, default=0 */
#define WOLCFG_SMIIACC          0x08    /* ?? */
#define WOLCFG_SGENWH           0x02
#define WOLCFG_PHYINTEN         0x01    /* 0:PHYINT trigger enable, 1:use internal MII */
/*                                         to report status change */

/*
 * Bits in WOLSR1
 */
#define WOLSR1_LINKOFF_INT      0x08
#define WOLSR1_LINKON_INT       0x04
#define WOLSR1_MAGIC_INT        0x02
#define WOLSR1_UNICAST_INT      0x01



/* Ethernet address filter type */
#define PKT_TYPE_NONE               0x0000  /* turn off receiver */
#define PKT_TYPE_DIRECTED           0x0001  /* obselete, directed address is always accepted */
#define PKT_TYPE_MULTICAST          0x0002
#define PKT_TYPE_ALL_MULTICAST      0x0004
#define PKT_TYPE_BROADCAST          0x0008
#define PKT_TYPE_PROMISCUOUS        0x0020
#define PKT_TYPE_LONG               0x2000  /* NOTE.... the definition of LONG is >2048 bytes in our chip */
#define PKT_TYPE_RUNT               0x4000
#define PKT_TYPE_ERROR              0x8000  /* accept error packets, e.g. CRC error */


/* Loopback mode */
#define MAC_LB_NONE         0x00
#define MAC_LB_INTERNAL     0x01
#define MAC_LB_EXTERNAL     0x02



/* enabled mask value of irq */
#if defined(_SIM)
#define IMR_MASK_VALUE      0x037BFFFFUL    /* initial value of IMR */
#else
#define IMR_MASK_VALUE      0x037BFFFFUL    /* initial value of IMR */
/*                                             ignore MIBFI,RACEI to */
/*                                             reduce intr. frequency */
/*                                             NOTE.... do not enable NoBuf int mask at NDIS driver */
/*                                             when (1) NoBuf -> RxThreshold = SF */
/*                                                  (2) OK    -> RxThreshold = original value */
#endif


/*
 * revision id
 */
#define REV_ID_VT3119_A0   0x00
#define REV_ID_VT3119_A1   0x01
#define REV_ID_VT3216_A0   0x10
#define REV_ID_VT3284_A0   0x20
#define REV_ID_VT3286_A1   0x80

/* wait time within loop */
#define CB_DELAY_LOOP_WAIT  10          /* 10ms */
#define CB_DELAY_MII_STABLE 660

/* max time out delay time */
#define W_MAX_TIMEOUT       0x0FFFU


#define CAMSIZE               64        /* CAM size, 0~63 */
#define VCAMSIZE              64        /* VCAM size, 0~63 */
#define MCAMSIZE              64        /* MCAM size, 0~63 */

/*---------------------  Export Types  ------------------------------*/
/*
 * MAC registers
 */
typedef struct tagSMacReg3119 {
	BYTE    abyPAR[6];                  /* 0x00 */
	BYTE    byRCR;
	BYTE    byTCR;

	BYTE    byCR0Set;                   /* 0x08 */
	BYTE    byCR1Set;
	BYTE    byCR2Set;
	BYTE    byCR3Set;

	BYTE    byCR0Clr;                   /* 0x0C */
	BYTE    byCR1Clr;
	BYTE    byCR2Clr;
	BYTE    byCR3Clr;

	BYTE    abyMARCAM[8];               /* 0x10 */

	DWORD   dwDecBaseHi;                /* 0x18 */
	WORD    wDbfBaseHi;                 /* 0x1C */
	WORD    wReserved_1E;

	BYTE    byISRCTL0;                  /* 0x20 */
	BYTE    byISRCTL1;
	BYTE    byTXESR;
	BYTE    byRXESR;

	DWORD   dwISR;                      /* 0x24 */
	DWORD   dwIMR;

	DWORD   dwTDStatusPort;             /* 0x2C */

	WORD    wTDCSRSet;                  /* 0x30 */
	BYTE    byRDCSR0Set;
	BYTE    byReserved_33;
	WORD    wTDCSRClr;
	BYTE    byRDCSR0Clr;
	BYTE    byReserved_37;

	DWORD   dwRDBase0Lo;                /* 0x38 */
	WORD    wRDIdx;                     /* 0x3C */
	WORD    wReserved_3E;

	DWORD   dwTDBase0Lo;                /* 0x40 */
	DWORD   dwTDBase1Lo;                /* 0x44 */
	DWORD   dwTDBase2Lo;                /* 0x48 */
	DWORD   dwTDBase3Lo;                /* 0x4C */

	WORD    wRDCSize;                   /* 0x50 */
	WORD    wTDCSize;                   /* 0x52 */
	WORD    wTDIdx0;                    /* 0x54 */
	WORD    wTDIdx1;                    /* 0x56 */
	WORD    wTDIdx2;                    /* 0x58 */
	WORD    wTDIdx3;                    /* 0x5A */
	WORD    wTxPauseTimer;              /* 0x5C */
	WORD    wRBRDU;                     /* 0x5E */

	DWORD   dwFIFOTest0;                /* 0x60 */
	DWORD   dwFIFOTest1;                /* 0x64 */

	BYTE    byCAMADDR;                  /* 0x68 */
	BYTE    byCAMCR;                    /* 0x69 */
	BYTE    byGFTEST;                   /* 0x6A */
	BYTE    byFTSTCMD;                  /* 0x6B */

	BYTE    byMIICFG;                   /* 0x6C */
	BYTE    byMIISR;
	BYTE    byPHYSR0;
	BYTE    byPHYSR1;
	BYTE    byMIICR;
	BYTE    byMIIADR;
	WORD    wMIIDATA;

	WORD    wSoftTimer0;                /* 0x74 */
	WORD    wSoftTimer1;

	BYTE    byCFGA;                     /* 0x78 */
	BYTE    byCFGB;
	BYTE    byCFGC;
	BYTE    byCFGD;

	BYTE    byDCFG0;                    /* 0x7C */
	BYTE    byDCFG1;
	BYTE    byMCFG0;
	BYTE    byMCFG1;

	BYTE    byTBIST;                    /* 0x80 */
	BYTE    byRBIST;
	BYTE    byPMCPORT;
	BYTE    bySTICKHW;

	BYTE    byMIBCR;                    /* 0x84 */
	BYTE    byReserved_85;
	BYTE    byRevID;
	BYTE    byPORSTS;

	DWORD   dwMIBRead;                  /* 0x88 */
	union {
		WORD    wBPMA;
		WORD    wEEWrData;
	};
	BYTE    byReserved_8E;
	BYTE    byBPMDWr;
	BYTE    byBPCMD;
	BYTE    byBPMDRd;

	BYTE    byEECHKSUM;                /* 0x92 */
	BYTE    byEECSR;

	WORD    wEERdData;                 /* 0x94 */
	BYTE    byEADDR;
	BYTE    byEMBCMD;


	BYTE    byJMPSR0;                  /* 0x98 */
	BYTE    byJMPSR1;
	BYTE    byJMPSR2;
	BYTE    byJMPSR3;
	BYTE    byCHIPGSR;                 /* 0x9C */
	BYTE    byTESTCFG;
	BYTE    byDEBUG;
	BYTE    byCHIPGCR;

	BYTE    byWOLCR0Set;               /* 0xA0 */
	BYTE    byWOLCR1Set;
	BYTE    byPWCFGSet;
	BYTE    byWOLCFGSet;

	BYTE    byWOLCR0Clr;               /* 0xA4 */
	BYTE    byWOLCR1Clr;
	BYTE    byPWCFGClr;
	BYTE    byWOLCFGClr;

	BYTE    byWOLSR0Set;               /* 0xA8 */
	BYTE    byWOLSR1Set;
	WORD    wReserved_AA;

	BYTE    byWOLSR0Clr;               /* 0xAC */
	BYTE    byWOLSR1Clr;
	WORD    wReserved_AE;

	WORD    wPatternCRC0;              /* 0xB0 */
	WORD    wPatternCRC1;
	WORD    wPatternCRC2;
	WORD    wPatternCRC3;
	WORD    wPatternCRC4;
	WORD    wPatternCRC5;
	WORD    wPatternCRC6;
	WORD    wPatternCRC7;

	DWORD   dwByteMask00;              /* 0xC0 */
	DWORD   dwByteMask01;
	DWORD   dwByteMask02;
	DWORD   dwByteMask03;
	DWORD   dwByteMask10;
	DWORD   dwByteMask11;
	DWORD   dwByteMask12;
	DWORD   dwByteMask13;
	DWORD   dwByteMask20;
	DWORD   dwByteMask21;
	DWORD   dwByteMask22;
	DWORD   dwByteMask23;
	DWORD   dwByteMask30;
	DWORD   dwByteMask31;
	DWORD   dwByteMask32;
	DWORD   dwByteMask33;

} SMacReg, SMacReg3119, DEF * PSMacReg, DEF * PSMacReg3119;




/*---------------------  Export Macros ------------------------------*/

#define MACvRegBitsOn(dwIoBase, byRegOfs, byBits)                		\
do {                                                                		\
	BYTE byData;                                                     	\
	VNSvInPortB(dwIoBase + byRegOfs, &byData);                       	\
	VNSvOutPortB(dwIoBase + byRegOfs, byData | (BYTE)(byBits));      	\
} while (0)


#define MACvRegBitsOff(dwIoBase, byRegOfs, byBits)                		\
